Repository: alexito8473/project_portfolio
Catalog: lib/l10n/app_*.arb
Languages: es

source: About me
es: Sobre mi

source: Download CV
es: Descargar CV

source: Knowledge
es: Conocimiento

source: Coming soon...
es: Proximamente...

# contact_me
source: Contact form
es: Contactame

# practices
source: Programmer intern
es: Programador en practicas

# formName
source: Name
es: Nombre

# formEmail
source: Email
es: Correo electrónico

# formMessage
source: Message
es: Mensaje

# formSubject
source: Subject
es: Sujeto

# formRequestCorrect
source: The message has been sent successfully
es: Se ha enviado correctamente el mensaje

# formRequestInCorrect
source: Error sending message
es: Error el enviar el mensaje

# sendEmail
source: Send
es: Enviar

source: Skills
es: Habilidades

# skills1
source: Problem solving
es: Resolución de problemas

# skills2
source: Teamwork
es: Trabajo en equipo

# skills3
source: Proactive communication
es: Comunicación proactiva

# textCommit
source: Commits made
es: Commits realizados

source: Work experience
es: Experiencia laboral

source: Projects
es: Proyectos

source: Tools
es: Herramientas

source: Mobile
es: Móvil

source: Server
es: Servidor

source: Experience
es: Experiencia

# myExperience
source: My experience using
es: Mi Experiencia usando

# javaExperience
source: During two years of training in a Higher Degree, I have developed a solid command of Java, following the best programming practices. I have worked on projects ranging from desktop applications to web applications, always applying principles of modularity, code reuse and design patterns.
es: Durante dos años de formación en un Grado Superior, he desarrollado un sólido dominio de Java, siguiendo las mejores prácticas de programación. He trabajado en proyectos que van desde aplicaciones de escritorio hasta aplicaciones web, siempre aplicando principios de modularidad, reutilización de código y patrones de diseño.

# netMauiExperience
source: I have been working with .NET MAUI for the past year, developing key skills in building cross-platform applications. Over this time, I have completed several mini projects that have allowed me to become more familiar with the capabilities and features of .NET MAUI.
es: He trabajado con .NET MAUI durante el último año, desarrollando habilidades clave en la creación de aplicaciones multiplataforma. A lo largo de este tiempo, he completado varios mini proyectos que me han permitido familiarizarme con las capacidades y características de .NET MAUI.

# flutterExperience
source: I have been working intensively with Flutter for a year, during which I have acquired an advanced level in the development of multiplatform applications. I have done professional internships using this framework, which has allowed me to apply my knowledge in real projects, optimizing user interfaces and managing efficient business logic.
es: Llevo un año trabajando intensamente con Flutter, durante el cual he adquirido un nivel avanzado en el desarrollo de aplicaciones multiplataforma. He realizado prácticas profesionales utilizando este framework, lo que me ha permitido aplicar mis conocimientos en proyectos reales, optimizando interfaces de usuario y gestionando lógica de negocio eficiente.

# androidExperience
source: I have been working with Android development for a year, gaining a solid understanding of building native apps. My passion for learning has led me to explore various areas of Android development, from creating intuitive user interfaces to API integration and local database management
es: He trabajado con desarrollo Android durante un año, adquiriendo una sólida comprensión de la creación de aplicaciones nativas. Mi pasión por aprender me ha llevado a explorar diversas áreas del desarrollo Android, desde la creación de interfaces de usuario intuitivas hasta la integración de APIs y la gestión de bases de datos locales.,

# phpExperience
source: I have acquired a solid knowledge of PHP, thanks to my intensive learning during the Higher Degree. This educational environment has provided me with a solid foundation in backend web development, allowing me to manage databases, develop dynamic applications
es: He adquirido un conocimiento sólido de PHP, gracias a mi aprendizaje intensivo durante el Grado Superior. Este entorno educativo me ha proporcionado una base sólida en desarrollo web backend, permitiéndome manejar bases de datos, desarrollar aplicaciones dinámicas

# kotlinExperience
source: I started learning Kotlin as a result of my work with Android development, quickly becoming familiar with its modern and concise syntax. As I delved deeper into its use for mobile applications, I have also begun to explore its capabilities for backend development.
es: Comencé a aprender Kotlin a raíz de mi trabajo con desarrollo Android, familiarizándome rápidamente con su sintaxis moderna y concisa. A medida que profundizaba en su uso para aplicaciones móviles, también he comenzado a explorar sus capacidades para el desarrollo backend.

# htmlExperience
source: I have studied HTML for several years in my higher education, which has allowed me to develop a solid level. I am able to create and structure web pages with a clear understanding of the essential tags and elements, optimizing the code for a clear and efficient presentation.
es: He estudiado HTML durante varios años en mi grado superior, lo que me ha permitido desarrollar un nivel sólido. Soy capaz de crear y estructurar páginas web con una comprensión clara de las etiquetas y elementos esenciales, optimizando el código para una presentación clara y eficiente.

# cssExperience
source: I have studied CSS for several years in my higher education, which has allowed me to acquire a good command of it. I can design and style web pages, handling properties and selectors accurately to achieve a visually appealing and well-structured design.
es: He estudiado CSS durante varios años en mi grado superior, lo que me ha permitido adquirir un buen dominio. Puedo diseñar y estilizar páginas web, manejando propiedades y selectores con precisión para lograr un diseño visualmente atractivo y bien estructurado.

# mysqlExperience
source: I have studied MySQL for several years in my higher education, which has allowed me to develop a good command of SQL. I have experience using SQL with PostgreSQL and connecting databases to Java applications, allowing me to handle complex queries and manage data efficiently in integrated environments.
es: He estudiado MySQL durante varios años en mi grado superior, lo que me ha permitido desarrollar un buen dominio de SQL. Tengo experiencia en el uso de SQL con PostgreSQL y en la conexión de bases de datos a aplicaciones Java, lo que me permite manejar consultas complejas y gestionar datos de manera eficiente en entornos integrados.

# mongoExperience
source: I have been learning MongoDB for less than a year, getting familiar with its syntax and operation. Although my experience is recent, I have a good understanding of how to manage NoSQL databases and work with JSON documents to store and query data in a flexible way.
es: He estado aprendiendo MongoDB durante menos de un año, familiarizándome con su sintaxis y funcionamiento. Aunque mi experiencia es reciente, tengo un buen entendimiento de cómo gestionar bases de datos NoSQL y trabajar con documentos JSON para almacenar y consultar datos de manera flexible.

# firebaseExperience
source: I have worked with Firebase on several projects, including my undergraduate thesis, and have performed tests using its Realtime Database functionality. I have experience integrating Firebase to manage authentication, real-time data storage, and synchronization across web and mobile applications.
es: He trabajado con Firebase en varios proyectos, incluyendo mi trabajo de fin de grado, y he realizado pruebas utilizando su funcionalidad de Realtime Database. Tengo experiencia en la integración de Firebase para gestionar la autenticación, almacenamiento de datos en tiempo real y sincronización en aplicaciones web y móviles.

# gitExperience
source: In my undergraduate degree, I learned how to use Git, focusing on version management and branch consistency. I understand how to manage repositories, make commits, and manage branches to efficiently collaborate on projects, ensuring strong and organized version control.
es: En mi grado superior, aprendí a usar Git, enfocándome en la gestión de versiones y la consistencia de las ramas. Entiendo cómo manejar repositorios, realizar commits, y gestionar ramas para colaborar eficientemente en proyectos, asegurando un control de versiones sólido y organizado.

# gitHubExperience
source: During my undergraduate degree, I learned how to use GitHub and I use it constantly for my projects. I have experience in repository management, team collaboration, and using tools like pull requests and issues to maintain an organized and efficient workflow.
es: Durante mi grado superior, aprendí a utilizar GitHub y lo uso constantemente para mis proyectos. Tengo experiencia en la gestión de repositorios, colaboración en equipo, y el uso de herramientas como pull requests e issues para mantener un flujo de trabajo organizado y eficiente.

# intelIjExperience
source: IntelliJ is the code editing platform I use regularly. I feel comfortable working in this environment, taking advantage of its tools and features to develop projects efficiently and productively.
es: IntelliJ es la plataforma de edición de código que utilizo habitualmente. Me siento cómodo trabajando en este entorno, aprovechando sus herramientas y características para desarrollar proyectos de manera eficiente y productiva.

# springExperience
source: I have a basic understanding of Spring Boot, but I am in the process of learning more to develop backend applications. As I gain more experience, I plan to delve deeper into its functionalities and capabilities to create robust and efficient solutions.
es: Tengo un conocimiento básico de Spring Boot, pero estoy en proceso de aprender más para desarrollar aplicaciones backend. A medida que adquiera más experiencia, planeo profundizar en sus funcionalidades y capacidades para crear soluciones robustas y eficientes.

# javaScriptExperience
source: I currently have a basic understanding of JavaScript, but I am in the process of learning more to improve my web development skills. I am working on gaining a deeper understanding of the language and its applications in creating interactive and dynamic interfaces.
es: Actualmente tengo un conocimiento básico de JavaScript, pero estoy en proceso de aprender más para mejorar mis habilidades en desarrollo web. Estoy trabajando para adquirir una comprensión más profunda del lenguaje y sus aplicaciones en la creación de interfaces interactivas y dinámicas.

# descriptionTasty
source: This is a final year project. The application uses Firebase with realtime, authentication, storage and Gemini. The purpose of the project is to be able to show the data of a product, as well as to be able to see on a map where the associated restaurants are located on the map.
es: Se trata de un proyecto de fin de grado. La aplicación hace uso de firebase con realtime, authentication, storage y Gemini. La finalidad del proyecto es poder mostrar los datos de un los producto, además de poder en un mapa donde están ubicados los restaurante asociados en el mapa.

# descriptionOtelo
source: Game made with Java without a graphical interface, it works through the terminal. It is made with Java 17 and following best practices.
es: Juego realizado con Java sin interfaz gráfica, funciona a través de la terminal. Esta realizado con Java 17 y siguiendo las mejores prácticas.

# descriptionGomoku
source: Game made with Java without a graphical interface. First project with several modes, player vs player, player vs bot and bot vs bot.
es: Juego realizado con Java sin interfaz gráfica. Primer proyecto con varias modalidades, jugador vs jugador, jugador vs bot y bot vs bot.

# descriptionAppTeacher
source: Project carried out in my higher education. It is an application aimed at teachers. Its objective is to be able to keep track of all the students in the app and to be able to see how many hours they have completed in total, as well as being able to see their personal data and finally being able to create a PDF of all their hours and work completed in the practices.
es: Proyecto realizado en mi grado superior. Se trata de una aplicación dirigida para los profesores su objetivo es poder tener un seguimientos de todos los alumnos de la app y poder visualizar cuantas horas llevan en total realizadas, además de poder ver sus datos personales y por último poder realizar un pdf de todas sus horas y trabajo realizado en las practicas.

# descriptionAppStudent
source: Project carried out in my higher education. It is an application aimed at students. Its objective is to control the work carried out in the module's practices, indicating how much time we have spent on the task and its time. It also has a cloud database where you can create a student account or log in with the Firebase authenticator.
es: Proyecto realizado en mi grado superior. Se trata de una aplicación dirigida para los estudiantes su objetivo es controlar el trabajo realizado en las practicas del modulo, indicando cuanto tiempo hemos realizado en la tarea y su tiempo, además consta de una base de datos en la nube donde podrás crear una cuenta de estudiante o iniciar sesión con el autentificador de firebase.

# descriptionUltraRestaurant
source: Project carried out in my higher education. It is an application for a food company that wants to be able to show its products. You can log in or register, and you can also view a product catalogue where you can filter them in different ways.
es: Proyecto realizado en mi grado superior. Se trata de una aplicación destinada a una empresa de comida, que quiera poder mostrar sus productos, podrás iniciar sesión o registrarte, además podrás visualizar un catalogo de productos donde podrás filtrarlos de distintas formas.

# descriptionImcCalculator
source: Project developed using the Maui .Net framework, it is a body mass index calculator.
es: Proyecto realizado en el framework .Net Maui, se trata de una calculadora sobre el índice de la masa corporal.
